In [1]:
#THE MERGE FUNCTION_____________FACILITATES MERGING OF DATASETS

In [2]:
#the merge function merge() allows us to merge dataframes together 
#using a similar logic as merging the SQL tables together

In [4]:
import pandas as pd

In [7]:
left=pd.DataFrame({"key1":["K0","K1","K2","K2"],"key2":["K0","K1","K0","K2"],"A":["A0","A1","A2","A3"],"B":["B0","B1","B2","B3"]})

In [8]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K0  A2  B2
3   K2   K2  A3  B3

In [11]:
right=pd.DataFrame({"key1":["K0","K1","K1","K2"],"key2":["K0","K0","K0","K2"],"c":["C0","C1","C2","C3"],"D":["D0","D1","D2","D3"]})

In [12]:
right

  key1 key2   c   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K2  C3  D3

In [14]:
pd.merge(left,right, on=["key1","key2"])#inner join

  key1 key2   A   B   c   D
0   K0   K0  A0  B0  C0  D0
1   K2   K2  A3  B3  C3  D3

In [15]:
pd.merge(left,right, how="outer",on=["key1","key2"])#outer join

  key1 key2    A    B    c    D
0   K0   K0   A0   B0   C0   D0
1   K1   K1   A1   B1  NaN  NaN
2   K2   K0   A2   B2  NaN  NaN
3   K2   K2   A3   B3   C3   D3
4   K1   K0  NaN  NaN   C1   D1
5   K1   K0  NaN  NaN   C2   D2

In [16]:
#similarly we can perform left and right join

In [ ]:
#for more information, refer SQL joins